renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
    //
    // Reset SW, HPRE, PPRE1, PPRE2, ADCPRE and MCO bits
    //
    //xHWREG(RCC_CFGR) &= 0xF0FF0000;
    xHWREG(RCC_CFGR) &= 0xF8FF0000;
    
    //
    // Reset HSEON, CSSON and PLLON bits 
    //
    xHWREG(RCC_CR) &= 0xFEF6FFFF;

    //
    // Reset HSEBYP bit
    //
    xHWREG(RCC_CR) &= 0xFFFBFFFF;

    //
    // Reset PLLSRC, PLLXTPRE, PLLMUL and USBPRE/OTGFSPRE bits
    //
    xHWREG(RCC_CFGR) &= 0xFF80FFFF;

    //
    // Reset HSEBYP bit
    //
    xHWREG(RCC_CR) &= 0xEBFFFFFF;
    
    //
    // Disable all interrupts and clear pending bits
    //
    xHWREG(RCC_CIR) &= 0x00FF0000;

    //xHWREG(RCC_CIR) |= 0x00001800;

    //
    // 
    //
    xHWREG(RCC_CFGR2) = 0x00000000; 
    
    //
    // Calc oscillator freq
    //
    s_ulExtClockMHz = ((ulConfig & SYSCTL_XTAL_MASK) >> 8);
    switch(ulConfig & SYSCTL_OSCSRC_M)
    {
        case SYSCTL_OSC_MAIN:
        case xSYSCTL_OSC_MAIN:
        {
            xASSERT(!(ulConfig & SYSCTL_MAIN_OSC_DIS));

            xHWREG(RCC_CR) &= ~RCC_CR_HSEON;
            xHWREG(RCC_CR) &= ~RCC_CR_HSERDY;

            xHWREG(RCC_CR) |= RCC_CR_HSEON;

            //
            // Wait till HSE is ready and if Time out is reached exit 
            //
            do
            {
                xtStatus = (xHWREG(RCC_CR) & RCC_CR_HSERDY) ? xtrue : xfalse;
                ulStartUpCounter++;  
            } while((ulStartUpCounter != 0x0500) && (xtStatus == xfalse));

            if(xtStatus == xtrue)
            {
                xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
                xHWREG(RCC_CFGR) |= 1;

                while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x04);
            }
            else
            {
                while(1);
            }
            
            ulOscFreq = s_ulExtClockMHz*1000000; 
            
            if((ulConfig & SYSCTL_INT_OSC_DIS)!=0)
            {
                xHWREG(RCC_CR) &= ~RCC_CR_HSION;
            }
            if((ulConfig & SYSCTL_PLL_PWRDN)!=0)
            {
                //xHWREG(RCC_CR) |= RCC_CR_PLLON;
                xHWREG(RCC_CR) &= ~RCC_CR_PLLON;
            }
            break;
        }
        case SYSCTL_OSC_INT:
        {
            xASSERT(!(ulConfig & SYSCTL_INT_OSC_DIS));

            xHWREG(RCC_CR) |= RCC_CR_HSION;

            //
            // Wait till HSI is ready 
            //
            while((xHWREG(RCC_CR) & RCC_CR_HSIRDY) != RCC_CR_HSIRDY);

            xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
            xHWREG(RCC_CFGR) |= 0;
            
            while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x00); 
            
            if((ulConfig & SYSCTL_INT_OSC_DIS)!=0)
            {
                xHWREG(RCC_CR) &= ~RCC_CR_HSION;
            }
            if((ulConfig & SYSCTL_PLL_PWRDN)!=0)
            {
                xHWREG(RCC_CR) |= RCC_CR_PLLON;
            }
            break;
        }
        default:
        {
            xASSERT(0);
            break;
        }
    }
    
    //
    //Enable prefetch Buffer 
    //
    xHWREG(FLASH_ACR) |= FLASH_ACR_PRFTBS;       
    
    if (ulSysClk <= 24000000)
    {
        //
        //Flash 0 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_0; 
    }
    else if(ulSysClk <= 48000000)
    {
        //
        //Flash 1 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_1;  
    }
    else if(ulSysClk <= 72000000)
    {
        
        //
        //Flash 2 wait state
        //
        xHWREG(FLASH_ACR) &= ~FLASH_ACR_LATENCY_M;
        xHWREG(FLASH_ACR) |= FLASH_ACR_LATENCY_2;  
    }

    xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PPRE2_M | RCC_CFGR_PPRE1_M | RCC_CFGR_HPRE_M);
    xHWREG(RCC_CFGR) |= SYSCTL_APB1CLOCK_DIV << RCC_CFGR_PPRE1_S;
    xHWREG(RCC_CFGR) |= SYSCTL_APB2CLOCK_DIV << RCC_CFGR_PPRE2_S;
    if(ulSysClk == ulOscFreq)
    {
        return;
    }
    else if (ulSysClk < ulOscFreq)
    {
        if((ulOscFreq % ulSysClk) == 0)
        {            
            int i = 0;
            for (i = 8; i >= 0; i--)
             {
                 if((ulOscFreq/ulSysClk) & (1<<i))
                 {
                     xHWREG(RCC_CFGR) |= (g_AHBPrescTable[i]) << RCC_CFGR_HPRE_S;
                     break;
                 }
             }          
        }
        else
        {
            xASSERT(0);
        }
        
    }
    else
    {
        xASSERT(!(ulConfig & xSYSCTL_PLL_PWRDN));
        xASSERT(((ulConfig & SYSCTL_OSCSRC_M) == xSYSCTL_OSC_MAIN) ||
                ((ulConfig & SYSCTL_OSCSRC_M) == xSYSCTL_OSC_INT));
        
        if((ulConfig & SYSCTL_PLL_MAIN) == SYSCTL_PLL_MAIN)
        {
            if((ulSysClk % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) |= RCC_CFGR_PLLSRC;
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk / ulOscFreq -2) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else if(((ulSysClk*2) % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) |= RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLSRC;
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk * 2 / ulOscFreq -2) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else
            {
                xASSERT(0);
                return;
            }
        }
        else
        {
            if(((ulSysClk*2) % ulOscFreq) == 0)
            {
                xHWREG(RCC_CFGR) &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLMUL_M);
                xHWREG(RCC_CFGR) |= ((ulSysClk * 2 / ulOscFreq) << 
                                     RCC_CFGR_PLLMUL_S) & RCC_CFGR_PLLMUL_M;
            }
            else
            {
                xASSERT(0);
                return;
            }
        }

        xHWREG(RCC_CR) |= RCC_CR_PLLON;
        while((xHWREG(RCC_CR) | RCC_CR_PLLRDY) == 0);

        xHWREG(RCC_CFGR) &= ~RCC_CFGR_SW_M;
        xHWREG(RCC_CFGR) |= RCC_CFGR_SW_PLL;
        while((xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M) != 0x08);

        return;
    }
}


//*****************************************************************************
//
//! \brief Enable the system control interrupts.
//!
//! \param ulIntFlags is the bit mask of the interrupt sources to be enabled.  
//!
//! Enables the indicated Sysctl interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlIntEnable(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) |= (ulIntFlags << 8);
}

//*****************************************************************************
//
//! \brief Disable the system control interrupts.
//!
//! \param ulIntFlags is the bit mask of the interrupt sources to be disabled.  
//!
//! Disable the indicated Sysctl interrupt sources.  Only the sources that are
//! enabled can be reflected to the processor interrupt; disabled sources have
//! no effect on the processor.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlIntDisable(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) &= ~(ulIntFlags << 8);
}

//*****************************************************************************
//
//! \brief Clear the system control interrupts flag.
//!
//! \param ulIntFlags is the bit mask of the interrupt flag to be cleared.  
//!
//! Clear the indicated Sysctl interrupt flag.
//!
//! The \e ulIntFlags parameter is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,\b SYSCTL_INT_CSS.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlIntFlagClear(unsigned long ulIntFlags)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            ((ulIntFlags & SYSCTL_INT_LSI) == SYSCTL_INT_LSI)   || 
            ((ulIntFlags & SYSCTL_INT_LSE) == SYSCTL_INT_LSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSE) == SYSCTL_INT_HSE)   ||
            ((ulIntFlags & SYSCTL_INT_HSI) == SYSCTL_INT_HSI)   ||
            ((ulIntFlags & SYSCTL_INT_PLL) == SYSCTL_INT_PLL)   ||
            ((ulIntFlags & SYSCTL_INT_PLL2) == SYSCTL_INT_PLL2) ||
            ((ulIntFlags & SYSCTL_INT_CSS) == SYSCTL_INT_CSS)   ||
            ((ulIntFlags & SYSCTL_INT_PLL3) == SYSCTL_INT_PLL3)
           );
    //
    // Enable the specified interrupts.
    //
    xHWREG(RCC_CIR) |= (ulIntFlags << 16);
}

//*****************************************************************************
//
//! \brief Get the system control interrupts flag.
//!
//! \param None.  
//!
//! Get the indicated Sysctl interrupt flag.
//!
//! \return the return value is the logical OR of any of the following:
//! \b SYSCTL_INT_LSI, \b SYSCTL_INT_LSE, \b SYSCTL_INT_HSE, 
//! \b SYSCTL_INT_HSI,  \b SYSCTL_INT_PLL,  \b SYSCTL_INT_PLL2,
//! \b SYSCTL_INT_PLL3,\b SYSCTL_INT_CSS.
//
//*****************************************************************************
unsigned long 
SysCtlIntFlagGet(void)
{ 
    //
    // return the system control interrupts flag.
    //
    return (xHWREG(RCC_CIR) & 0xFF);
}

//*****************************************************************************
//
//! \brief Get the system control reset flag.
//!
//! \param None.  
//!
//! Get the indicated Sysctl reset flag.
//!
//! \return the return value is the logical OR of any of the following:
//! \b SYSCTL_RESET_LPWR, \b SYSCTL_RESET_WWDG, \b SYSCTL_RESET_IWDG,
//! \b SYSCTL_RESET_SFT, \b SYSCTL_RESET_POR, \b SYSCTL_RESET_PIN.
//
//*****************************************************************************
unsigned long
SysCtlResetFlagGet(void)
{ 
    //
    // return the system control reset flag.
    //
    return (xHWREG(RCC_CSR) & 0xFC000000);
}

//*****************************************************************************
//
//! \brief Clear the system control reset flag.
//!
//! \param None.  
//!
//! Clear the indicated Sysctl reset flag.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlResetFlagClear(void)
{ 
    //
    // Clear the system control reset flag.
    //
    xHWREG(RCC_CSR) |= RCC_CSR_RMVF;
}

//*****************************************************************************
//
//! \brief Config the system control LSI clock.
//!
//! \param ulLSIConfig.  
//!
//! Config the system control LSI clock.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlLSIConfig(unsigned long ulLSIConfig)
{ 
    //
    // Check the arguments.
    //
    xASSERT(
            (ulLSIConfig == SYSCTL_LSI_OSC_DIS) ||
            (ulLSIConfig == SYSCTL_LSI_OSC_EN)
            );
    
    //
    // Config the system control LSI clock.
    //
    xHWREG(RCC_CSR) &= ~(RCC_CSR_LSION | RCC_CSR_RMVF);
    xHWREG(RCC_CSR) |= ulLSIConfig;
    while(!(xHWREG(RCC_CSR) & RCC_CSR_LSIRDY));
}

//*****************************************************************************
//
//! \brief Config the system control LSE clock.
//!
//! \param ulLSEConfig .  
//!
//! Config the system control LSE clock.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlLSEConfig(unsigned long ulLSEConfig)
{ 
    //
    // Check the arguments.
    //
    xASSERT((ulLSEConfig == SYSCTL_LSE_OSC_DIS) ||
            (ulLSEConfig == SYSCTL_LSE_OSC_EN));
    //
    // Config the system control LSE clock.
    //
    xHWREG(RCC_BDCR) &= ~RCC_BDCR_LSEON;
    xHWREG(RCC_BDCR) |= ulLSEConfig;
    while(!(xHWREG(RCC_BDCR) & RCC_BDCR_LSERDY));
}

//*****************************************************************************
//
//! \brief Set a peripheral clock source and peripheral divide.
//!
//! \param ulPeripheralSrc is the peripheral clock source to set.
//!
//! Peripherals clock source are seted with this function.  At power-up, all 
//! Peripherals clock source are Peripherals clock source; they must be set in 
//! order to operate or respond to register reads/writes.
//!
//! The \e ulPeripheralSrc parameter must be only one of the following values:
//! \ref STM32F1xx_SysCtl_Stclk_Src.
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlPeripheralClockSourceSet(unsigned long ulPeripheralSrc)
{
 //
    // Check the arguments.
    //
    xASSERT(
            (ulPeripheralSrc==SYSCTL_RTC_LSE)       ||
            (ulPeripheralSrc==SYSCTL_RTC_LSI)       ||
            (ulPeripheralSrc==SYSCTL_RTC_LSE_128)   ||
            (ulPeripheralSrc==SYSCTL_MCO_SYSCLK)    ||
            (ulPeripheralSrc==SYSCTL_MCO_HSI)       ||
            (ulPeripheralSrc==SYSCTL_MCO_HSE)       ||
            (ulPeripheralSrc==SYSCTL_MCO_PLL_2)     ||
            (ulPeripheralSrc==SYSCTL_MCO_PLL3_2)    ||
            (ulPeripheralSrc==SYSCTL_MCO_XT1)       ||
            (ulPeripheralSrc==SYSCTL_MCO_PLL3)      ||
            (ulPeripheralSrc==SYSCTL_I2S3_SYSCLK)   ||
            (ulPeripheralSrc==SYSCTL_I2S3_PLL3)     ||
            (ulPeripheralSrc==SYSCTL_I2S2_SYSCLK)   ||
            (ulPeripheralSrc==SYSCTL_I2S2_PLL3)     ||
            (ulPeripheralSrc==SYSCTL_MCO_PLL2)         
           );
    if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 1)
    {
        xHWREG(RCC_BDCR) &= ~(RCC_BDCR_RTCSEL_M);
    }
    else if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 0)
    {
        xHWREG(RCC_CFGR) &= ~(RCC_CFGR_MCO_M);
    }
    else if(SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc) == 2)
    {
        xHWREG(RCC_CFGR2) &= ~(SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc | 1));
    }
    xHWREG(g_pulCLKSELRegs[SYSCTL_PERIPH_INDEX_CLK(ulPeripheralSrc)]) |=
        SYSCTL_PERIPH_ENUM_CLK(ulPeripheralSrc);
}

//*****************************************************************************
//
//! \brief Resets the device.
//!
//! This function will perform a software reset of the entire device.  The
//! processor and all peripherals will be reset and all device registers will
//! return to their default values (with the exception of the reset cause
//! register, which will maintain its current value but have the software reset
//! bit set as well).
//!
//! \return This function does not return.
//
//*****************************************************************************
void
SysCtlReset(void)
{
    //
    // Perform a software reset request.  This will cause the device to reset,
    // no further code will be executed.
    //
    xHWREG(NVIC_APINT) = NVIC_APINT_VECTKEY | NVIC_APINT_SYSRESETREQ;

    //
    // The device should have reset, so this should never be reached.  Just in
    // case, loop forever.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
//! \brief Puts the processor into sleep mode.
//!
//! This function places the processor into sleep mode; it will not return
//! until the processor returns to run mode.  The peripherals that are enabled
//! via SysCtlPeripheralSleepEnable() continue to operate and can wake up the
//! processor (if automatic clock gating is enabled with
//! SysCtlPeripheralClockGating(), otherwise all peripherals continue to
//! operate).
//!
//! \return None.
//
//*****************************************************************************
void
SysCtlSleep(void)
{
    //
    // Wait for an interrupt.
    //
    xCPUwfi();
}

//*****************************************************************************
//
//! \brief The function is used to Reset Backup domain 
//!
//! \param None.
//!
//! The function is used to Reset Backup domain 
//!
//! \return None.
//
//*****************************************************************************
void 
SysCtlBackupDomainReset(void)
{
    xHWREG(RCC_BDCR) |= RCC_BDCR_BDRST;
}

//*****************************************************************************
//
//! \brief The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get HCLK clock and the UNIT is in Hz
//!
//! \return HCLK clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlHClockGet(void)
{
    unsigned long ulTemp = 0, ulPllMull = 0, ulPllSource = 0, ulPresc = 0;
    unsigned long ulHclk;

    //
    // STM32F10X_CL
    //
#ifdef  STM32F10X_CL
    unsigned long ulPrediv1Source = 0, ulPrediv1Factor = 0, ulPrediv2Factor = 0, 
                  ulPll2Mull = 0;
#endif 

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
    unsigned long ulPrediv1Factor = 0;
#endif
    
    //
    // Get SYSCLK source
    //
    ulTemp = xHWREG(RCC_CFGR) & RCC_CFGR_SWS_M;
    switch (ulTemp)
    {
        //
        // HSI used as system clock
        //
        case 0x00: 
        {
            ulHclk = (unsigned long)8000000;
            break;
        }
        //
        // HSE used as system clock
        //
        case 0x04: 
        {
            ulHclk = s_ulExtClockMHz*1000000;
            break;
        }
        //
        // PLL used as system clock
        //
        case 0x08: 
        {
            //
            // Get PLL clock source and multiplication factor
            //
            ulPllMull = xHWREG(RCC_CFGR) & RCC_CFGR_PLLMUL_M;
            ulPllSource = xHWREG(RCC_CFGR) & RCC_CFGR_PLLSRC;
                  
#ifndef STM32F10X_CL      
            ulPllMull = ( ulPllMull >> 18) + 2;
      
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
 #if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
                //
                // HSE oscillator clock selected as PREDIV1 clock entry 
                //
                ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull; 
 #else
                //
                // HSE selected as PLL clock entry 
                //
                if ((xHWREG(RCC_CFGR) & RCC_CFGR_PLLXTPRE) != 0)
                {
                    //
                    // HSE oscillator clock divided by 2 
                    //
                    ulHclk = ((s_ulExtClockMHz*1000000) >> 1) * ulPllMull;
                }
                else
                {
                    ulHclk = s_ulExtClockMHz*1000000 * ulPllMull;
                }
 #endif
            }
#else
            ulPllMull = ulPllMull >> 18;
          
            if (ulPllMull != 0x0D)
            {
                ulPllMull += 2;
            }
            else
            { 
                //
                // PLL multiplication factor = PLL input clock * 6.5 
                //
                ulPllMull = 13 / 2; 
            }
                  
            if (ulPllSource == 0x00)
            {
                //
                // HSI oscillator clock divided by 2 selected as PLL clock entry 
                //
                ulHclk = (8000000 >> 1) * ulPllMull;
            }
            else
            {
                //
                // PREDIV1 selected as PLL clock entry 
                //
                
                //
                // Get PREDIV1 clock source and division factor
                //
                ulPrediv1Source = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1SRC);
                ulPrediv1Factor = (xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV1_M) + 1;
              
                if (ulPrediv1Source == 0)
                { 
                    //
                    // HSE oscillator clock selected as PREDIV1 clock entry 
                    //
                    ulHclk = (s_ulExtClockMHz*1000000 / ulPrediv1Factor) * ulPllMull;          
                }
                else
                {
                    //
                    // PLL2 clock selected as PREDIV1 clock entry 
                    //
        
                    //
                    // Get PREDIV2 division factor and PLL2 multiplication factor 
                    //
                    ulPrediv2Factor = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PREDIV2_M)
                                        >> RCC_CFGR2_PREDIV2_S) + 1;
                    ulPll2Mull = ((xHWREG(RCC_CFGR2) & RCC_CFGR2_PLL2MUL_M) >> 8 ) + 2; 
                    ulHclk = (((s_ulExtClockMHz*1000000 / ulPrediv2Factor) * 
                             ulPll2Mull) / ulPrediv1Factor) * ulPllMull;                         
                }
            }
#endif 
        break;
        }
        default: 
        {
            ulHclk = 8000000;
            break;
        }
    }
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_HPRE_M) >> RCC_CFGR_HPRE_S;
    ulPresc = g_APBAHBPrescTable[ulTemp];
    ulHclk = ulHclk >> ulPresc;
    return ulHclk;
}

//*****************************************************************************
//
//! \brief The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB1 clock and the UNIT is in Hz
//!
//! \return APB1 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB1ClockGet(void)
{
    unsigned long ulTemp,ulAPB1Clock;
    ulAPB1Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE1_M) >> RCC_CFGR_PPRE1_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB1Clock = ulAPB1Clock >> ulTemp;
    return ulAPB1Clock;
}

