renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
//*****************************************************************************
//
//! \brief The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \param None.
//!
//! The function is used to Get APB2 clock and the UNIT is in Hz
//!
//! \return APB2 clock frequency in Hz 
//
//*****************************************************************************
unsigned long 
SysCtlAPB2ClockGet(void)
{
    unsigned long ulTemp,ulAPB2Clock;
    ulAPB2Clock = SysCtlHClockGet();
    ulTemp = (xHWREG(RCC_CFGR) & RCC_CFGR_PPRE2_M) >> RCC_CFGR_PPRE2_S;
    ulTemp = (unsigned long)g_APBAHBPrescTable[ulTemp];
    ulAPB2Clock = ulAPB2Clock >> ulTemp;
    return ulAPB2Clock;
}




//*****************************************************************************
//
//! \brief Enables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to enable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessEnable(void)
{
    xHWREG(PWR_CR) |= PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Disables access to the RTC and backup registers.
//!
//! \param None.
//!
//! The function is used to disable access to the RTC and backup registers.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlBackupAccessDisable(void)
{
    xHWREG(PWR_CR) &= ~PWR_CR_DBP;
}

//*****************************************************************************
//
//! \brief Read Backup domain register 
//!
//! \param ulRegisterID which backup register you want to read.
//!
//!  The ulRegisterID can be one of follow value: BKP_DRx (x=1,2,3...42)
//!  
//! \return the content of the selected register 
//
//*****************************************************************************
unsigned long
SysCtlBackupDataRead(unsigned long ulRegisterID)
{
    xASSERT(
            //
            // medium-density and low-density devices
            // 
            (ulRegisterID == BKP_DR1 )||
            (ulRegisterID == BKP_DR2 )||
            (ulRegisterID == BKP_DR3 )||
            (ulRegisterID == BKP_DR4 )||
            (ulRegisterID == BKP_DR5 )||
            (ulRegisterID == BKP_DR6 )||
            (ulRegisterID == BKP_DR7 )||
            (ulRegisterID == BKP_DR8 )||
            (ulRegisterID == BKP_DR9 )||
            (ulRegisterID == BKP_DR10)||       
            //
            // high-density, XL-density and connectivity line devices
            //
            (ulRegisterID == BKP_DR11)||
            (ulRegisterID == BKP_DR12)||
            (ulRegisterID == BKP_DR13)||
            (ulRegisterID == BKP_DR14)||
            (ulRegisterID == BKP_DR15)||
            (ulRegisterID == BKP_DR16)||
            (ulRegisterID == BKP_DR17)||
            (ulRegisterID == BKP_DR18)||
            (ulRegisterID == BKP_DR19)||
            (ulRegisterID == BKP_DR20)||
            (ulRegisterID == BKP_DR21)||
            (ulRegisterID == BKP_DR22)||
            (ulRegisterID == BKP_DR23)||
            (ulRegisterID == BKP_DR24)||
            (ulRegisterID == BKP_DR25)||
            (ulRegisterID == BKP_DR26)||
            (ulRegisterID == BKP_DR27)||
            (ulRegisterID == BKP_DR28)||
            (ulRegisterID == BKP_DR29)||
            (ulRegisterID == BKP_DR30)||
            (ulRegisterID == BKP_DR31)||
            (ulRegisterID == BKP_DR32)||
            (ulRegisterID == BKP_DR33)||
            (ulRegisterID == BKP_DR34)||
            (ulRegisterID == BKP_DR35)||
            (ulRegisterID == BKP_DR36)||
            (ulRegisterID == BKP_DR37)||
            (ulRegisterID == BKP_DR38)||
            (ulRegisterID == BKP_DR39)||
            (ulRegisterID == BKP_DR40)||
            (ulRegisterID == BKP_DR41)||
            (ulRegisterID == BKP_DR42)||
            );
    return xHWREG(ulRegisterID);
}

//*****************************************************************************
//
//! \brief Write Backup domain register 
//!
//! \param ulRegisterID which backup register you want to write.
//!
//!  The ulRegisterID can be one of follow value: BKP_DRx (x=1,2,3...42)
//! \param ulValue half word data, the data that you want to write into 
//!  
//! \return None 
//
//*****************************************************************************
void
SysCtlBackupDataWrite(unsigned long ulRegisterID,unsigned long ulValue)
{
    xASSERT(
            //
            // medium-density and low-density devices
            // 
            (ulRegisterID == BKP_DR1 )||
            (ulRegisterID == BKP_DR2 )||
            (ulRegisterID == BKP_DR3 )||
            (ulRegisterID == BKP_DR4 )||
            (ulRegisterID == BKP_DR5 )||
            (ulRegisterID == BKP_DR6 )||
            (ulRegisterID == BKP_DR7 )||
            (ulRegisterID == BKP_DR8 )||
            (ulRegisterID == BKP_DR9 )||
            (ulRegisterID == BKP_DR10)||       
            //
            // high-density, XL-density and connectivity line devices
            //
            (ulRegisterID == BKP_DR11)||
            (ulRegisterID == BKP_DR12)||
            (ulRegisterID == BKP_DR13)||
            (ulRegisterID == BKP_DR14)||
            (ulRegisterID == BKP_DR15)||
            (ulRegisterID == BKP_DR16)||
            (ulRegisterID == BKP_DR17)||
            (ulRegisterID == BKP_DR18)||
            (ulRegisterID == BKP_DR19)||
            (ulRegisterID == BKP_DR20)||
            (ulRegisterID == BKP_DR21)||
            (ulRegisterID == BKP_DR22)||
            (ulRegisterID == BKP_DR23)||
            (ulRegisterID == BKP_DR24)||
            (ulRegisterID == BKP_DR25)||
            (ulRegisterID == BKP_DR26)||
            (ulRegisterID == BKP_DR27)||
            (ulRegisterID == BKP_DR28)||
            (ulRegisterID == BKP_DR29)||
            (ulRegisterID == BKP_DR30)||
            (ulRegisterID == BKP_DR31)||
            (ulRegisterID == BKP_DR32)||
            (ulRegisterID == BKP_DR33)||
            (ulRegisterID == BKP_DR34)||
            (ulRegisterID == BKP_DR35)||
            (ulRegisterID == BKP_DR36)||
            (ulRegisterID == BKP_DR37)||
            (ulRegisterID == BKP_DR38)||
            (ulRegisterID == BKP_DR39)||
            (ulRegisterID == BKP_DR40)||
            (ulRegisterID == BKP_DR41)||
            (ulRegisterID == BKP_DR42)||
            );
     xHWREG(ulRegisterID) = (ulValue & 0x0000FFFF);
}



//*****************************************************************************
//
//! \brief configures the tamper pin active level 
//!
//! \param ulLevelMode specifies the volatge level for active tamper pin 
//!
//! the tamper active level is chosen with one of the following values:
//! \ref BKP_CR_TPAL_LOW, \ref BKP_CR_TPAL_HIGH.
//!
//! the function is used to configures the threshold detected by the 
//! power voltage detector(pvd).
//!
//! \return none 
//
//*****************************************************************************
void SysCtlTamperPinActiveLevelConfig(unsigned long ulLevelMode)
{
    xASSERT(
            (ulLevelMode == BKP_CR_TPAL_HIGH)||
            (ulLevelMode == BKP_CR_TPAL_LOW )
            );
    if (ulLevelMode == BKP_CR_TPAL_LOW)
    {
       xHWREG(BKP_CR) |= BKP_CR_TPAL;
    }
    else
    {
       xHWREG(BKP_CR) &= ~BKP_CR_TPAL;
    }
}


//*****************************************************************************
//
//! \brief Enable the Tamper Pin functionality.
//!
//! \param None.
//!
//! The function is used to Enable the Tamper Pin functionality.
//!
//! \return None 
//
//*****************************************************************************

void SysCtlTamperPinEnable(void)
{
    xHWREG(BKP_CR) |= BKP_CR_TPE;
}

//*****************************************************************************
//
//! \brief Disable the Tamper Pin functionality.
//!
//! \param None.
//!
//! The function is used to Disable the Tamper Pin functionality.
//!
//! \return None 
//
//*****************************************************************************

void SysCtlTamperPinDisable(void)
{
    xHWREG(BKP_CR) &= ~BKP_CR_TPE;
}


//*****************************************************************************
//
//! \brief Get the Tamper interrupts flag.
//!
//! \param None.  
//!
//! Get the Tamper interrupt flag.
//!
//! \return the return value is one of the following:
//! \ref xtrue
//! \reg xfalse 
//
//*****************************************************************************
unsigned long SysCtlTamperIntFlagGet(void)
{
   return (xHWREG(BKP_CSR) & BKP_CSR_TIF); 
}


//*****************************************************************************
//
//! \brief Get the Tamper Event flag.
//!
//! \param None.  
//!
//! Get the Tamper Event flag.
//!
//! \return the return value is one of the following:
//! \ref xtrue
//! \reg xfalse 
//
//*****************************************************************************
unsigned long SysCtlTamperEventFlagGet(void)
{
   return (xHWREG(BKP_CSR) & BKP_CSR_TEF); 
}

//*****************************************************************************
//
//! \brief Enable the Tamper Pin interrupt.
//!
//! \param None.
//!
//! The function is used to Enable the Tamper Pin interrupt.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntEnable(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_TPIE; 
}


//*****************************************************************************
//
//! \brief Disable the Tamper Pin interrupt.
//!
//! \param None.
//!
//! The function is used to Disable the Tamper Pin interrupt.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntDisable(void)
{
    xHWREG(BKP_CSR) &= ~BKP_CSR_TPIE; 
}

//*****************************************************************************
//
//! \brief Clear the Tamper Pin interrupt Flag.
//!
//! \param None.
//!
//! The function is used to Clear the Tamper Pin interrupt Flag.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperIntFlagClear(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_CTI; 
}


//*****************************************************************************
//
//! \brief Clear the Tamper Pin Event Flag.
//!
//! \param None.
//!
//! The function is used to Clear the Tamper Pin Event Flag.
//!
//! \return None 
//
//*****************************************************************************
void SysCtlTamperEventFlagClear(void)
{
    xHWREG(BKP_CSR) |= BKP_CSR_CTE; 
}


//*****************************************************************************
//
//! \brief Configures the voltage threshold detected by the Power Voltage 
//! Detector(PVD).
//!
//! \param ulConfig specifies the PVD detection level configurations
//!
//! The \e ulConfig parameter is the logical OR of two different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The enable or disable PVD is chosen with one of the following values:
//! \ref SYSCTL_PVD_EN, \ref SYSCTL_PVD_DIS.
//!
//! The PVD detection level is chosen with one of the following values:
//! \ref SYSCTL_PVDLEVEL_2V2, \ref SYSCTL_PVDLEVEL_2V3 \ref SYSCTL_PVDLEVEL_2V4,
//! \ref SYSCTL_PVDLEVEL_2V5, \ref SYSCTL_PVDLEVEL_2V6, \ref SYSCTL_PVDLEVEL_2V7,
//! \ref SYSCTL_PVDLEVEL_2V8, \ref SYSCTL_PVDLEVEL_2V9.
//!
//! The function is used to configures the voltage threshold detected by the 
//! Power Voltage Detector(PVD).
//!
//! \return None 
//
//*****************************************************************************
void
SysCtlPVDLevelConfig(unsigned long ulConfig)
{
    xASSERT(
            (ulConfig == SYSCTL_PVDLEVEL_2V2)||
            (ulConfig == SYSCTL_PVDLEVEL_2V3)||
            (ulConfig == SYSCTL_PVDLEVEL_2V4)||
            (ulConfig == SYSCTL_PVDLEVEL_2V5)||
            (ulConfig == SYSCTL_PVDLEVEL_2V6)||
            (ulConfig == SYSCTL_PVDLEVEL_2V7)||
            (ulConfig == SYSCTL_PVDLEVEL_2V8)||
            (ulConfig == SYSCTL_PVDLEVEL_2V9)
            );

