renjun1234/cox/CoX/CoX_Peripheral/CoX_Peripheral_STM32F1xx/libcox/xsysctl.c
    xHWREG(PWR_CR) &= ~(PWR_CR_PVDE | PWR_CR_PLS_M);
    xHWREG(PWR_CR) |= ulConfig;
}

//*****************************************************************************
//
//! \brief Enables the WakeUp Pin functionality.
//!
//! \param None.
//!
//! The function is used to enable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlWakeUpPinEnable(void)
{
    xHWREG(PWR_CSR) |= PWR_CSR_EWUP;
}

//*****************************************************************************
//
//! \brief Disables the WakeUp Pin functionality.
//!
//! \param None.
//!
//! The function is used to disable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlWakeUpPinDisable(void)
{
    xHWREG(PWR_CSR) &= ~PWR_CSR_EWUP;
}

//*****************************************************************************
//
//! \brief Enters STOP mode.
//!
//! \param ulConfig specifies the STOP mode configurations.
//!
//! The \e ulConfig parameter is the logical OR of two different values,
//! many of which are grouped into sets where only one can be chosen.
//!
//! The Voltage regulator is chosen with one of the following values:
//! \ref SYSCTL_REGULATOR_ON, \ref SYSCTL_REGULATOR_LP.
//!
//! The WFI or WFE instruction is chosen with one of the following values:
//! \ref SYSCTL_STOP_WFI, \ref SYSCTL_STOP_WFE.
//!
//! The function is used to disable the WakeUp Pin functionality.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlStopModeConfig(unsigned long ulConfig)
{
    xHWREG(PWR_CR) &= ~(PWR_CR_PDDS | PWR_CR_LPDS);
    xHWREG(PWR_CR) |= (ulConfig & PWR_CR_LPDS);
    xHWREG(NVIC_SYS_CTRL) |= NVIC_SYS_CTRL_SLEEPDEEP;
    if(ulConfig & SYSCTL_STOP_WFI)
    {
        xCPUwfi();
    }
    else
    {
        xCPUwfe();
    }
}

//*****************************************************************************
//
//! \brief Enters STANDBY mode.
//!
//! \param None.
//!
//! The function is used to enters STANDBY mode.
//!
//! \return None 
//
//*****************************************************************************
void 
SysCtlEnterStandbyMode(void)
{
    xHWREG(PWR_CR) |= PWR_CR_CWUF;
    xHWREG(PWR_CR) |= PWR_CR_PDDS;
    xHWREG(NVIC_SYS_CTRL) |= NVIC_SYS_CTRL_SLEEPDEEP;
    xCPUwfi();
}

//*****************************************************************************
//
//! \brief Get all the PWR flag is set or not.
//!
//! \param None.
//!
//! The function is used to check whether the specified PWR flag is set or not.
//!
//! \return Flag status 
//! Flag status can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//
//*****************************************************************************
unsigned long 
SysCtlFlagStatusGet(void)
{
    return (xHWREG(PWR_CSR) & (PWR_CSR_WUF | PWR_CSR_SBF | PWR_CSR_PVDO));
}

//*****************************************************************************
//
//! \brief Clears the PWR's pending flags.
//!
//! \param None.
//! This parameter can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//!
//! The function is used to check whether the specified PWR flag is set or not.
//!
//! \return Flag status 
//! Flag status can be "OR" value of the following values:
//! \ref SYSCTL_WAKEUP_FLAG, \ref SYSCTL_STANDBY_FLAG, \ref SYSCTL_PVD_FLAG.
//
//*****************************************************************************
void
SysCtlFlagStatusClear(unsigned long ulFlag)
{
    xHWREG(PWR_CR) |= (ulFlag & (PWR_CR_CWUF | PWR_CR_CSBF)) << 2;
}

